---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceSet.#ctor
source: html/074c4930-5ae8-fe51-738f-f602442b3a20.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet.#ctor Method

Initializes a new instance of the SpaceSet class

## Syntax (C#)
```csharp
public SpaceSet()
```